load/report/ec2_20260417_124727/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 24080,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 898.3136627907005,
    "medianResTime" : 671.0,
    "minResTime" : 81.0,
    "maxResTime" : 21068.0,
    "pct1ResTime" : 1635.9000000000015,
    "pct2ResTime" : 2280.800000000003,
    "pct3ResTime" : 4143.960000000006,
    "throughput" : 75.05088063232238,
    "receivedKBytesPerSec" : 19.462499298735544,
    "sentKBytesPerSec" : 253.68443859105062
  },
  "POST /detect" : {
    "transaction" : "POST /detect",
    "sampleCount" : 1722,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1937.1835075493616,
    "medianResTime" : 2097.0,
    "minResTime" : 231.0,
    "maxResTime" : 2481.0,
    "pct1ResTime" : 2109.0,
    "pct2ResTime" : 2115.0,
    "pct3ResTime" : 2197.0,
    "throughput" : 9.458368349069817,
    "receivedKBytesPerSec" : 2.420012214312785,
    "sentKBytesPerSec" : 351.133074474352
  },
  "POST /verify" : {
    "transaction" : "POST /verify",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 278.9024999999998,
    "medianResTime" : 280.0,
    "minResTime" : 154.0,
    "maxResTime" : 431.0,
    "pct1ResTime" : 332.0,
    "pct2ResTime" : 352.9,
    "pct3ResTime" : 411.98,
    "throughput" : 32.43856945908685,
    "receivedKBytesPerSec" : 8.109642364771714,
    "sentKBytesPerSec" : 1204.3362194367853
  },
  "GET /health" : {
    "transaction" : "GET /health",
    "sampleCount" : 21958,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 828.1265142544853,
    "medianResTime" : 671.0,
    "minResTime" : 81.0,
    "maxResTime" : 21068.0,
    "pct1ResTime" : 1635.9000000000015,
    "pct2ResTime" : 2280.800000000003,
    "pct3ResTime" : 4143.960000000006,
    "throughput" : 173.66889177133098,
    "receivedKBytesPerSec" : 45.11320821403714,
    "sentKBytesPerSec" : 20.691020308693727
  }
}